{
    "tasks": [
        {
            "task_id": 1,
            "task_name": "Task 1: Customized Greeting",
            "task_description": "This task introduces you to string concatenation in Python. You'll write a Python program that prints a customized greeting, such as 'Hello, Alice!' where 'Alice' is the user's name.",
            "incorrect_code": "user_name = Alice\nprint('Hello,' user_name)",
            "correct_code": "user_name = 'Alice'\nprint('Hello, ' + user_name)",
            "description": "The incorrect code misses the quotation marks around the user's name and does not properly concatenate the string.",
            "explanation": "In Python, strings must be enclosed in quotes, and you can concatenate strings using the '+' operator.",
            "expected_output": "Hello, Alice!",
            "follow_up_challenge": "Modify the program to print 'Welcome, Alice!' instead. This will ensure you understand how to modify strings within the print function.",
            "reflection_question": "Why is it important to use quotation marks for strings in Python? How does string concatenation help in creating dynamic output?"
        },
        {
            "task_id": 2,
            "task_name": "Task 2: Writing a Simple Function",
            "task_description": "This task introduces you to writing functions in Python. You'll write a Python function that takes two numbers as arguments, adds them, and returns the result.",
            "incorrect_code": "def add_numbers(a, b):\nresult = a plus b\nreturn result\n\nprint(add_numbers(3, 5))",
            "correct_code": "def add_numbers(a, b):\nresult = a + b\nreturn result",
            "description": "The incorrect code uses non-Pythonic syntax for the addition operation within a function.",
            "explanation": "In Python, functions allow you to encapsulate code for reuse. The correct syntax for addition is '+', not 'plus'.",
            "expected_output": "8",
            "follow_up_challenge": "Modify the function to subtract the second number from the first instead of adding them.",
            "reflection_question": "Why do you think functions might useful in programming? How do you think functions might help you organise and reuse your code effectively?"
        },
        {
            "task_id": 3,
            "task_name": "Task 3: Variable Manipulation",
            "task_description": "In this task, you'll work with variables and perform operations on them. You'll write a Python program that assigns values to variables and performs arithmetic operations, then prints the results.",
            "incorrect_code": "a = 8\nb = 2\nsum = A + b\nproduct = a * B\nprint(sum, Product)",
            "correct_code": "a = 8\nb = 2\nsum = a + b\nproduct = a * b\nprint(sum, product)",
            "description": "The incorrect code has case sensitivity issues and uses undeclared variables.",
            "explanation": "In Python, variable names are case-sensitive, meaning 'A' and 'a' are different. Always ensure you are using the correct variable names.",
            "expected_output": "10 16",
            "follow_up_challenge": "Create a new variable that stores the difference between the two numbers and print it.",
            "reflection_question": "How does Python's case sensitivity in variable names impact the correctness of your code? Why do you think its important to consistently use the correct variable names?"
        },
        {
            "task_id": 4,
            "task_name": "Task 4: Using Loops",
            "task_description": "This task introduces you to loops in Python. You'll write a Python program that uses a for loop to print the numbers from 1 to 5.",
            "incorrect_code": "for i in range(1, 5):\nprint i",
            "correct_code": "for i in range(1, 6):\n    print(i)",
            "description": "The incorrect code uses outdated print syntax and has an off-by-one error in the loop range.",
            "explanation": "In Python, print is a function and requires parentheses. Also, to include the number 5, the range should end at 6, since the end value is exclusive.",
            "expected_output": "1\n2\n3\n4\n5",
            "follow_up_challenge": "Modify the loop to print only even numbers from 1 to 10.",
            "reflection_question": "How do you think loops help automate repetitive tasks in programming? What are some potential problems you might need to watch out for when using loops?"
        }
    ]
}